In [ ]:
import pandas as pd
data={
    'name':["zahid","walid","reza","imran"],
    'Age':[11,None,22,None],
    'Marks':[77,88,None,None]
}
df=pd.DataFrame(data)
df

In [ ]:
df.isnull().sum()

In [ ]:
df.isnull().mean()*100

In [ ]:
df['Age'].fillna(df['Age'].mean(), inplace=True)
df['Marks'].fillna(df['Marks'].mean(), inplace=True)

In [21]:
df

    name   Age  Marks
0  zahid  11.0   77.0
1  walid  16.5   88.0
2   reza  22.0   82.5
3  imran  16.5   82.5